gingerologist/nrf5_sdk_17_10/examples/ble_peripheral/ble_app_sleepmon/main.c
BLE_EEG_DEF(m_eeg);
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

/*
 *  NRFX_TWIM_ENABLED         1
 *  NRFX_TWI_ENABLED          1
 *  TWI_ENABLED               1
 *  TWI1_ENABLED              1
 *  TWI0_USE_EASY_DMA	        0
 *  NRF_TWI_MNGR_ENABLED (optional, if twi_mngr is used)
 */
#define TWI1_INSTANCE_ID                1
#define TWI1_MAX_PENDING_TRANSACTIONS   4
#define QMI8658A_SCL_PIN                21      // P0.21
#define QMI8658A_SDA_PIN                19      // P0.19
#define QMI8658A_INT1_PIN               20      // P0.20
#define QMI8658A_INT2_PIN               22      // P0.22

// use twi manager instead
// static const nrf_drv_twi_t twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE);
NRF_TWI_MNGR_DEF(m_nrf_twi_mngr, TWI1_MAX_PENDING_TRANSACTIONS, TWI1_INSTANCE_ID);
static nrf_drv_twi_config_t const qmi8658a_twi_config = {
    .scl                = QMI8658A_SCL_PIN,
    .sda                = QMI8658A_SDA_PIN,
    .frequency          = NRF_DRV_TWI_FREQ_400K,
    .interrupt_priority = TWI_DEFAULT_CONFIG_IRQ_PRIORITY,  // todo
    .clear_bus_init     = TWI_DEFAULT_CONFIG_CLR_BUS_INIT,
    .hold_bus_uninit    = TWI_DEFAULT_CONFIG_HOLD_BUS_UNINIT,
};

static void qmi8658a_int2_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action);

static qmi8658a_dev_t qmi8658a_dev = {
    .p_twi_mngr         = &m_nrf_twi_mngr,
    .p_twi_cfg          = &qmi8658a_twi_config,
    .int1_pin           = QMI8658A_INT1_PIN,
    .int1_evt_handler   = NULL,
    .int2_pin           = QMI8658A_INT2_PIN,
    .int2_evt_handler   = qmi8658a_int2_handler
};

#define SPI0_INSTANCE_ID                0
#define SPI0_MAX_PENDING_TRANSACTIONS   4

#define KS1092_RST_PIN                  6       // P0.06
#define KS1092_SS_PIN                   7       // P0.07
#define KS1092_SCK_PIN                  8       // P0.08
#define KS1092_MISO_PIN                 17      // P0.17 (PIN20)
#define KS1092_MOSI_PIN                 18      // P0.18 (PIN21)

NRF_SPI_MNGR_DEF(m_nrf_spi_mngr, SPI0_MAX_PENDING_TRANSACTIONS, SPI0_INSTANCE_ID);
static nrf_drv_spi_config_t const ks1092_spi_config = {
    .sck_pin            = KS1092_SCK_PIN,
    .mosi_pin           = KS1092_MOSI_PIN,
    .miso_pin           = KS1092_MISO_PIN,
    .ss_pin             = KS1092_SS_PIN,
    .irq_priority       = SPI_DEFAULT_CONFIG_IRQ_PRIORITY,
    .orc                = 0xFF,
    .frequency          = NRF_DRV_SPI_FREQ_1M,
    .mode               = NRF_DRV_SPI_MODE_1, // !!! important
    .bit_order          = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST
};

static nrfx_gpiote_out_config_t const ks1092_reset_pin_out_config = NRFX_GPIOTE_CONFIG_OUT_SIMPLE(true);

static ks1092_dev_t ks1092_dev = {
    .p_spi_mngr         = &m_nrf_spi_mngr,
    .p_spi_cfg          = &ks1092_spi_config,
    .reset_pin          = KS1092_RST_PIN,
    .p_reset_pin_cfg    = &ks1092_reset_pin_out_config
};

typedef enum BottomEventType
{
  BE_NONE = 0,
  BE_CONNECTED,
  BE_DISCONNECTED,
  BE_NOTIFICATION_ENABLED,
  BE_NOTIFICATION_DISABLED,
  BE_SAADC,
  BE_IMUINT2,
} BottomEventType_t;

typedef struct BottomEvent
{
  BottomEventType_t type;
  void * p_data;
} BottomEvent_t;

#define BEVENTS_IN_QUEUE      4

static TaskHandle_t           m_bottom_thread;
QueueHandle_t                 m_beq;

static void qmi8658a_int2_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    BottomEvent_t be = { .type = BE_IMUINT2 };
    xQueueSendFromISR(m_beq, &be, NULL);
}

/* YOUR_JOB: Declare all services structure your application is using
 *  BLE_XYZ_DEF(m_xyz);
 */
#define SAMPLE_TYPE_EEG         0x01
#define SAMPLE_TYPE_IMU         0x02

#define SAMPLES_IN_BUFFER       120

static const nrf_drv_timer_t    m_adc_timer = NRF_DRV_TIMER_INSTANCE(1);
static nrf_ppi_channel_t        m_ppi_channel;

typedef __packed struct {
    uint8_t type;
    uint8_t version;            // 1
    uint16_t length;            // fixed 244
    uint32_t seq_num;
    int16_t sample[SAMPLES_IN_BUFFER];
} sample_packet_t;

static sample_packet_t          m_eeg_packet[2] __attribute__((aligned(0x4))) = {
    { .type = SAMPLE_TYPE_EEG,
      .version = 1,
      .length = 244             // TODO use offset of
    },
    { .type = SAMPLE_TYPE_EEG,
      .version = 1,
      .length = 244
    },
};

static sample_packet_t          m_imu_packet = {
    .type = SAMPLE_TYPE_IMU,
    .version = 1,
    .length = 244
};

static void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;

        int16_t * p_buffer = p_event->data.done.p_buffer;
        // if (p_buffer == &m_buffer_pool[0][2] || p_buffer == &m_buffer_pool[1][2])
        if (p_buffer == m_eeg_packet[0].sample || p_buffer == m_eeg_packet[1].sample)
        {
          // do_something(p_buffer);
          BottomEvent_t be = { .type = BE_SAADC };
          be.p_data = p_buffer;
          xQueueSendFromISR(m_beq, &be, NULL);
        }
        err_code = nrf_drv_saadc_buffer_convert(p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);
    }
}

static void adc_timer_handler(nrf_timer_event_t event_type, void * p_context)
{
}

/*
 * nrf_drv_saadc_buffer_convert explained
 * https://devzone.nordicsemi.com/f/nordic-q-a/60230/what-is-the-purpose-of-nrf_drv_saadc_buffer_convert
 *
 * https://devzone.nordicsemi.com/f/nordic-q-a/46039/configuring-adc-sampling-rate-and-simultaneous-reading-from-multiple-channels
 */
void saadc_sampling_event_init(void)
{
    // const uint32_t period = 500;
    ret_code_t err_code;

    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
    err_code = nrf_drv_timer_init(&m_adc_timer, &timer_cfg, adc_timer_handler);
    APP_ERROR_CHECK(err_code);

