gingerologist/nrf5_sdk_17_10/examples/ble_peripheral/ble_app_sleepmon/main.c
//    /* setup m_timer for compare event every 400ms */
//    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_adc_timer, period);
//    nrf_drv_timer_extended_compare(&m_adc_timer,
//                                   NRF_TIMER_CC_CHANNEL0,
//                                   ticks,
//                                   NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,
//                                   false);

    // nrf_drv_timer_enable(&m_adc_timer);
    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_adc_timer,
                                                                                NRF_TIMER_CC_CHANNEL0);
    uint32_t saadc_sample_task_addr   = nrf_drv_saadc_sample_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
                                          timer_compare_event_addr,
                                          saadc_sample_task_addr);

    APP_ERROR_CHECK(err_code);
}

static void saadc_init(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_0_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN1);

    channel_0_config.gain = NRF_SAADC_GAIN1_4;

    nrf_saadc_channel_config_t channel_1_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);

    channel_1_config.gain = NRF_SAADC_GAIN1_4;

    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_0_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(1, &channel_1_config);
    APP_ERROR_CHECK(err_code);

    // reserve first two sample for sequence number
    err_code = nrf_drv_saadc_buffer_convert((nrf_saadc_value_t *)m_eeg_packet[0].sample, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert((nrf_saadc_value_t *)m_eeg_packet[1].sample, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
}

void saadc_sampling_event_enable(void)
{
    ret_code_t err_code;
    uint32_t period;
    uint8_t sps = m_eeg.sps_shadow;
    if (sps == 0)
    {
      period = 8; // 125sps
      NRF_LOG_INFO("Set sampling rate to 125sps (8ms)");
    }
    else if (sps == 1)
    {
      period = 4; // 250sps
      NRF_LOG_INFO("Set sampling rate to 250sps (4ms)");
    }
    else
    {
      period = 8; // default 125sps
      NRF_LOG_INFO("Set sampling rate to 125sps (8ms, fallback)");
    }

    /* setup m_timer for compare event every 400ms */
    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_adc_timer, period);
    nrf_drv_timer_extended_compare(&m_adc_timer,
                                   NRF_TIMER_CC_CHANNEL0,
                                   ticks,
                                   NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,
                                   false);

    nrf_drv_timer_enable(&m_adc_timer);
    err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);
}

void saadc_sampling_event_disable(void)
{
    ret_code_t err_code = nrf_drv_ppi_channel_disable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_disable(&m_adc_timer);
}

static void on_eeg_evt(ble_eeg_t * p_eeg, ble_eeg_evt_t * p_evt)
{
}

static void eeg_sps_write_handler (uint16_t conn_handle, ble_eeg_t * p_eeg, uint8_t new_sps)
{
    ret_code_t err_code;
    ble_gatts_value_t gatts_value;

    if (new_sps > 1) return;

    gatts_value.len = sizeof(uint8_t);
    gatts_value.offset = 0;
    gatts_value.p_value = &new_sps;

    err_code = sd_ble_gatts_value_set(conn_handle, p_eeg->sps_handles.value_handle, &gatts_value);
    if (err_code != NRF_SUCCESS)
    {
      NRF_LOG_WARNING("failed to write sps value, error code: %d", err_code);
    }
    else
    {
      m_eeg.sps_shadow = new_sps;
      NRF_LOG_INFO("sps set to %d", new_sps);
    }
}

static void eeg_gain_write_handler (uint16_t conn_handle, ble_eeg_t * p_eeg, uint8_t new_gain)
{
    ret_code_t err_code;
    ble_gatts_value_t gatts_value;

    if (new_gain > 7) return;

    gatts_value.len = sizeof(uint8_t);
    gatts_value.offset = 0;
    gatts_value.p_value = &new_gain;

    err_code = sd_ble_gatts_value_set(conn_handle, p_eeg->gain_handles.value_handle, &gatts_value);
    if (err_code != NRF_SUCCESS)
    {
      NRF_LOG_WARNING("failed to write gain value, error code: %d", err_code);
    }
    else
    {
      m_eeg.gain_shadow = new_gain;
      NRF_LOG_INFO("gain set to %d", new_gain);
    }
}

static void eeg_sample_notification_enabled()
{
    m_eeg.sample_notifying = true;
    BottomEvent_t be = {
      .type = BE_NOTIFICATION_ENABLED,
    };
    xQueueSendFromISR(m_beq, &be, NULL);
}

/*
 * This function is idempotent for hiding sample_notifying member.
 */
static void eeg_sample_notification_disabled()
{
    if (m_eeg.sample_notifying == true) {
        BottomEvent_t be = {
        .type = BE_NOTIFICATION_DISABLED,
        };

        xQueueSendFromISR(m_beq, &be, NULL);
        m_eeg.sample_notifying = false;
    }
}

static bool eeg_sample_notifying()
{
    return m_eeg.sample_notifying;
}

static void eeg_init(void)
{
    ret_code_t      err_code;
    ble_eeg_init_t  eeg_init_obj;

    memset(&eeg_init_obj, 0, sizeof(eeg_init_obj));

    eeg_init_obj.evt_handler          = on_eeg_evt;
    eeg_init_obj.initial_sps          = 1;
    eeg_init_obj.initial_gain         = 0;

    eeg_init_obj.sps_write_handler = eeg_sps_write_handler;
    eeg_init_obj.gain_write_handler = eeg_gain_write_handler;
    eeg_init_obj.sample_notification_enabled = eeg_sample_notification_enabled;
    eeg_init_obj.sample_notification_disabled = eeg_sample_notification_disabled;

    //eeg_init_obj.
    err_code = ble_eeg_init(&m_eeg, &eeg_init_obj);
    APP_ERROR_CHECK(err_code);

    saadc_init();
    saadc_sampling_event_init();
    // saadc_sampling_event_enable();
}


