gingerologist/nrf5_sdk_17_10/examples/ble_peripheral/ble_app_sleepmon/main.c
    left = left / (SAMPLES_IN_BUFFER / 2);
    right = right / (SAMPLES_IN_BUFFER / 2);

    // NRF_LOG_INFO("sn %d, l %d, r %d", sn, left, right);

    ble_gatts_hvx_params_t hvx_params = {0};

    hvx_params.handle = m_eeg.samples_handles.value_handle; // p_hrs->hrm_handles.value_handle;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
    hvx_params.offset = 0;
    hvx_params.p_len  = &len;                   // this is a bidirectional param
    hvx_params.p_data = (uint8_t*)pkt;

    // is this required?
    if (m_eeg.conn_handle == BLE_CONN_HANDLE_INVALID)
    {
      NRF_LOG_ERROR("BLE_CONN_HANDLE_INVALID right before calling sd_ble_gatts_hvx");
      return;
    }

    err_code = sd_ble_gatts_hvx(m_eeg.conn_handle, &hvx_params);

    /*
    * 0x3002 -> BLE_ERROR_INVALID_CONN_HANDLE; defined in ble_err.h
    * 0x000c -> NRF_ERROR_DATA_SIZE;
    */
    if (err_code != NRF_SUCCESS)
    {
      NRF_LOG_ERROR("(eeg) sd_ble_gatts_hvx error, %d", err_code);
    }

    if (err_code == NRF_ERROR_DATA_SIZE)
    {
      NRF_LOG_INFO("len is %d", len);
      NRF_LOG_INFO("*(hvx_params.p_len) is %d", *(hvx_params.p_len));
    }
}

static void bottom_thread(void * arg)
{
    ret_code_t  err_code;
    uint32_t    eeg_seq_num = 0;
    uint32_t    imu_seq_num = 0;
    int         imu_offset;
    uint8_t     status0;

    NRF_LOG_INFO("Bottom thread started");

    ks1092_init(&ks1092_dev);
    qmi8658a_init(&qmi8658a_dev);

    for(;;)
    {
        BottomEvent_t be;
        xQueueReceive(m_beq, &be, portMAX_DELAY);

        switch (be.type)
        {
        case BE_NONE:
            break;
        case BE_CONNECTED:
            NRF_LOG_INFO("Connected.");
            break;
        case BE_DISCONNECTED:
            NRF_LOG_INFO("Disconnected.");
            break;
        case BE_NOTIFICATION_ENABLED: {
            err_code = ks1092_write(&ks1092_dev, m_eeg.gain_shadow, KS1092_CHAN_OFF);
            APP_ERROR_CHECK(err_code);

            saadc_sampling_event_enable();
            nrfx_gpiote_in_event_enable(QMI8658A_INT2_PIN, true);
            // qmi8658a_reset();
            // vTaskDelay(1);
            qmi8658a_config(&qmi8658a_dev);
            // vTaskDelay(1);
            // qmi8658a_enable();
            eeg_seq_num = 0;
            imu_seq_num = 0;
            imu_offset = 0;
            NRF_LOG_INFO("Start sampling (notification on)");
        } break;
        case BE_NOTIFICATION_DISABLED: {
            qmi8658a_disable(&qmi8658a_dev);
            nrfx_gpiote_in_event_enable(QMI8658A_INT2_PIN, false);
            saadc_sampling_event_disable();
            ks1092_write(&ks1092_dev, KS1092_CHAN_OFF, KS1092_CHAN_OFF);
            NRF_LOG_INFO("Stop sampling (notification off)");
        } break;
        case BE_SAADC: {
            if (eeg_sample_notifying())
            {
                do_something((int16_t*)be.p_data, eeg_seq_num++);
            }
        } break;
        case BE_IMUINT2:
            if (eeg_sample_notifying())
            {
                qmi8658a_read(&qmi8658a_dev, QMI8658A_STATUS0, &status0, 1);
                if (status0 & 0x01)
                {
                    int16_t * p = (int16_t *)&m_imu_packet.sample[imu_offset];
                    qmi8658a_read(&qmi8658a_dev, QMI8658A_AX_L, (uint8_t *)p, QMI8658A_BYTES_IN_DATA);
                    imu_offset += QMI8658A_SAMPLES_IN_DATA;

                    NRF_LOG_INFO(
                        "ax %d, ay %d, az %d, gx %d, gy %d, gz %d",
                        p[0], p[1], p[2], p[3], p[4], p[5]);

                    if (imu_offset >= SAMPLES_IN_BUFFER)
                    {
                        imu_offset = 0;
                        m_imu_packet.seq_num = imu_seq_num++;

                        uint16_t len = sizeof(m_imu_packet);

                        ble_gatts_hvx_params_t hvx_params = {0};

                        hvx_params.handle = m_eeg.samples_handles.value_handle; // p_hrs->hrm_handles.value_handle;
                        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
                        hvx_params.offset = 0;
                        hvx_params.p_len  = &len;                   // this is a bidirectional param
                        hvx_params.p_data = (uint8_t*)&m_imu_packet;

                        ret_code_t err_code = sd_ble_gatts_hvx(m_eeg.conn_handle, &hvx_params);

                        /*
                        * 0x3002 -> BLE_ERROR_INVALID_CONN_HANDLE; defined in ble_err.h
                        * 0x000c -> NRF_ERROR_DATA_SIZE;
                        */
                        if (err_code != NRF_SUCCESS)
                        {
                            NRF_LOG_ERROR("(imu) sd_ble_gatts_hvx error, %d", err_code);
                        }

                        if (err_code == NRF_ERROR_DATA_SIZE)
                        {
                            NRF_LOG_INFO("len is %d", len);
                            NRF_LOG_INFO("*(hvx_params.p_len) is %d", *(hvx_params.p_len));
                        }
                    }
                }
            }
            break;
        }
    }
}

/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    bool erase_bonds;

    // Initialize.
    log_init();

 #if NRF_LOG_ENABLED
    // Start execution.
    if (pdPASS != xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#endif

    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();

    application_timers_start();

    // NRF_SDH_BLE_GATT_MAX_MTU_SIZE is definedin sdk_config.h
    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);

    // Start execution.
    // SEGGER_RTT_WriteString(0, "\n^^^ rtt ^^^\n");
    NRF_LOG_RAW_INFO("\n^^^ sleepmon start ^^^\n");
    nrf_sdh_freertos_init(advertising_start, &erase_bonds);

    m_beq = xQueueCreate(BEVENTS_IN_QUEUE, sizeof(BottomEvent_t));
    if (m_beq == NULL)
    {
      APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
    }

    if (pdPASS != xTaskCreate(bottom_thread, "BOTTOM", 256, NULL, 1, &m_bottom_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    vTaskStartScheduler();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
